from constants import EffectType, EFFECTTYPE, VARIABLEID, TARGET, Target, CharGroup


ED_CHAR_GROUP_READER = {
    '无类型': 0, 
    '学生': 1,
    '教师': 2
}

ED_CHAR_GROUP_READER_INVERT = {
    0: '无类型', 
    1: '学生',
    2: '教师'
}

ED_EFFECT_TYPE_READER = {
    '伤害': 1,
    '治疗': 2,
    #'击杀': 3,
    '增加': 4,
    '设定': 5,
    '随机': 6,
    'Buff': 7,
    'Buff 清除': 8,
    #'特殊': 9
}

ED_EFFECT_TYPE_READER_INVERT = {
    1: '伤害',
    2: '治疗',
    #3: '击杀',
    4: '增加',
    5: '设定',
    6: '随机',
    7: 'Buff',
    8: 'Buff 清除',
    #9: '特殊'
}

ED_TARGET_READER = {
    '敌方出战': 1,
    '我方出战': 2,
    '敌方全体': 3,
    '我方全体': 4,
    '敌方非场上角色': 5,
    '我方非场上角色': 6,
    '自身': 7,
    '所有角色': 8,
    #'指定角色': 9,
    #'指定位置': 10,
    #'伤害来源': 11,
    #'组': 12,
    #'并集': 13,
    #'交集': 14
}

ED_TARGET_READER_INVERT = {
    1: '敌方出战',
    2: '我方出战',
    3: '敌方全体',
    4: '我方全体',
    5: '敌方非场上角色',
    6: '我方非场上角色',
    7: '自身',
    8: '所有角色',
    #9: '指定角色',
    #10: '指定位置',
    #11: '伤害来源',
    #12: '组',
    #13: '并集',
    #14: '交集'
}

ED_VARIABLEID_READER = {
    '生命值': '1',
    '攻击力': '2',
    '攻击次数': '3',
    '技能次数': '4',
    '换人次数': '5',
    '回合数': '6',
    '护盾值': '7',
    '标记数': '8'
}

ED_VARIABLEID_READER_INVERT = {
    '1': '生命值',
    '2': '攻击力',
    '3': '攻击次数',
    '4': '技能次数',
    '5': '换人次数',
    '6': '回合数',
    '7': '护盾值',
    '8': '标记数'
}

ED_SKILL_TYPE_READER = {
    '主动攻击': 1,
    '主动非攻击': 2,
    '被动': 3
}

ED_SKILL_TYPE_READER_INVERT = {
    1: '主动攻击',
    2: '主动非攻击',
    3: '被动'
}

ED_BUFF_TYPE_READER = {
    '无': 0, 
    '改变打出伤害': 1, 
    '改变受到伤害': 2,  
    '改变属性': 3, 
    '定时执行效果': 4, 
    '禁止使用技能': 5, 
    '禁止攻击': 6
}

ED_BUFF_TYPE_READER_INVERT = {
    0: '无',
    1: '改变打出伤害',
    2: '改变受到伤害',
    3: '改变属性',
    4: '定时执行效果',
    5: '禁止使用技能',
    6: '禁止攻击'
}

ED_BUFF_POSITIVITY_READER = {
    '正面': 0,
    '负面': 1,
    '中性': 2,
    '不被清除标识': 3
}

ED_BUFF_POSITIVITY_READER_INVERT = {
    0: '正面', 
    1: '负面', 
    2: '中性', 
    3: '不被清除标识'
}